ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_adc_safecheck_regs.xml
<module id="ADC_SAFECHECK_REGS" HW_revision="" description="ADC SAFECHECK Registers">
	<register id="CHECKCONFIG" width="16" page="0" offset="0x0" instances="1" instaddr="2" internal="0" description="ADC Check Configuration Register">
		<bitfield id="SWSYNC" description="Result Safe Check SW Force Sync." begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CHKEN" description="Result Safe Check Module Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="CHECKSTATUS" width="16" page="0" offset="0x4" instances="1" instaddr="2" internal="0" description="ADC Check Status Register">
		<bitfield id="RES1READY" description="Result Safe Check Result 1 Arrived " begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RES2READY" description="Result Safe Check Result 2 Arrived " begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="OOT" description="Safe Check OOT Flag" begin="2" end="2" width="1" rwaccess="R"/>
	</register>
	<register id="ADCRESSEL1" width="16" page="0" offset="0x8" instances="1" instaddr="2" internal="0" description="ADC Check 1 Select Register">
		<bitfield id="ADCSEL" description="Result Safe Check ADC Select 1 " begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="ADCRESULTSEL" description="Result Safe Check Result Select 1 " begin="9" end="4" width="6" rwaccess="RW"/>
	</register>
	<register id="ADCRESSEL2" width="16" page="0" offset="0xc" instances="1" instaddr="2" internal="0" description="ADC Check 2 Select Register">
		<bitfield id="ADCSEL" description="Result Safe Check ADC Select 2 " begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="ADCRESULTSEL" description="Result Safe Check Result Select 2 " begin="9" end="4" width="6" rwaccess="RW"/>
	</register>
	<register id="TOLERANCE" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="ADC Check Tolerance Register">
		<bitfield id="TOLERANCE" description="Result Safe Check Tolerance" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="CHECKRESULT1" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="ADC Check Captured Result 1 ">
		<bitfield id="RESULT" description="Result Safe Check Captured Result" begin="23" end="0" width="24" rwaccess="R"/>
	</register>
	<register id="CHECKRESULT2" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="ADC Check Captured Result 2 ">
		<bitfield id="RESULT" description="Result Safe Check Captured Result" begin="23" end="0" width="24" rwaccess="R"/>
	</register>
</module>
